<?php
$matrix = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
];

// print_r($matrix);

echo $matrix[0][0];
// Базові алгоритми для роботи із двомірними масивами
// Перебір усіх елементів
$n = count($matrix);
$m = count($matrix[0]);
echo $n;
echo $m;

for ($i=0;$i<$n;$i++){
    for ($j=0;$j<$n;$j++){
        echo $matrix[$i][$j]."<br>";
    }
}

// Базові алгоритми для масивів: пошук мінімально/максимального; сортування;

// Головна діагональ
for ($i=0;$i<$n;$i++){
    for ($j=0;$j<$n;$j++){
        if($i==$j)
            echo $matrix[$i][$j]."<br>";
    }
}
echo ("<br>");

// Зворотня діагональ
for ($i=0;$i<$n;$i++){
    for ($j=0;$j<$n;$j++){
        if(($n-$i-1)==$j)
            echo $matrix[$i][$j]."<br>";
    }
}



