-- phpMyAdmin SQL Dump
-- version 4.7.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Июл 05 2018 г., 08:31
-- Версия сервера: 10.1.25-MariaDB
-- Версия PHP: 7.1.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `statistics`
--

-- --------------------------------------------------------

--
-- Структура таблицы `indicators`
--

CREATE TABLE `indicators` (
  `id` int(11) NOT NULL,
  `name` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `sphere_id` int(11) NOT NULL,
  `parent_id` int(11) NOT NULL,
  `unit_of_measurement` varchar(60) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `source_name` int(11) NOT NULL,
  `source_link` int(11) NOT NULL,
  `period` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `indicators`
--

INSERT INTO `indicators` (`id`, `name`, `sphere_id`, `parent_id`, `unit_of_measurement`, `source_name`, `source_link`, `period`) VALUES
(1, 'Індекси промислової продукції за основними видами діяльності', 1, 0, '%', 0, 0, 1),
(2, 'Обсяг реалізованої промислової продукції за основними видами діяльності', 1, 0, 'млн. грн.', 0, 0, 1),
(3, 'Індекси сільськогосподарської продукції', 2, 0, '%', 0, 0, 1),
(4, 'Виробництво продукції тваринництва усіма категоріями господарств', 2, 0, '', 0, 0, 1),
(5, 'реалізація на забій ', 2, 4, 'тис.т (%)', 0, 0, 1),
(6, 'виробництво молока', 2, 4, 'тис. т (%)', 0, 0, 1),
(7, 'кількість одержаних яєць', 2, 4, 'млн.шт. (%)', 0, 0, 0),
(8, 'Кількість сільськогосподарських тварин', 2, 0, 'тис.голів (%)', 0, 0, 1),
(9, 'великої рогатої худоби', 2, 8, 'тис.голів (%)', 0, 0, 1),
(10, 'свиней', 2, 8, 'тис.голів (%)', 0, 0, 1),
(11, 'птиці', 2, 8, 'тис.голів (%)', 0, 0, 1),
(12, 'Виробництво продукції рослинництва усіма категоріями господарств', 2, 0, 'тис.т (%)', 0, 0, 2),
(13, 'Урожайність (за видами культур)', 2, 0, 'ц/га', 0, 0, 2),
(14, 'Перевезено (відправлено) вантажів', 3, 0, 'млн. т. (%)', 0, 0, 1),
(15, 'Перевезено (відправлено) пасажирів', 3, 0, 'млн. пас (%)', 0, 0, 1),
(16, 'Фінансовий результат до оподаткування великих та середніх підприємств за видами економічної діяльності', 4, 0, 'млн.грн.', 0, 0, 3),
(17, 'Сума прибутку прибуткових підприємств', 4, 0, 'млн. грн. (%)', 0, 0, 3),
(18, 'Кількість збиткових підприємств у % до загальної кількості підприємств', 4, 0, '%', 0, 0, 3),
(19, 'Обсяг виконаних будівельних робіт', 5, 0, 'млн.грн.', 0, 0, 0),
(20, 'Індекс будівельних робіт', 5, 0, ' %', 0, 0, 0),
(21, 'Обсяг введення в експлуатацію загальної площі житла', 5, 0, 'тис.кв.м', 0, 0, 3),
(22, 'Темп зростання (зниження) введення загальної площі житла', 5, 0, ' %', 0, 0, 3),
(23, 'Обсяг освоєння капітальних інвестицій:', 6, 0, ' млн.грн', 0, 0, 3),
(24, 'за рахунок власних коштів підприємств', 6, 23, 'млн.грн', 0, 0, 3),
(25, 'за рахунок місцевих    бюджетів', 6, 23, 'млн.грн', 0, 0, 3),
(26, 'Обсяг капітальних інвестицій на будівництво житла', 6, 0, 'млн.грн', 0, 0, 3),
(27, 'Темп зростання (зниження) обсягів  капітальних інвестицій', 6, 0, '%', 0, 0, 3),
(28, 'Середньомісячна заробітна плата штатного працівника', 7, 0, 'грн', 0, 0, 3),
(29, 'Темп зростання середньомісячної заробітної плати', 7, 0, '%', 0, 0, 3),
(30, 'Реальна заробітна плата', 7, 0, '%', 0, 0, 3),
(31, 'Заборгованість із заробітної плати, всього', 7, 0, 'млн.грн', 0, 0, 3),
(32, 'Заборгованість із заробітної плати, \r\nна економічно-активних підприємствах', 7, 31, 'млн.грн', 0, 0, 1),
(33, 'Темп зростання (зниження) заборгованості із заробітної плати', 7, 0, '%', 0, 0, 1),
(34, ', в т.ч. на економічно-активних підприємствах', 7, 33, '%', 0, 0, 1),
(35, 'Рівень зареєстрованого безробіття', 8, 0, '%', 0, 0, 1),
(36, 'Навантаження на одне вільне робоче місце', 8, 0, 'осіб', 0, 0, 1),
(37, 'Рівень  безробіття за методологією МОП', 8, 0, '%', 0, 0, 3);

-- --------------------------------------------------------

--
-- Структура таблицы `spheres`
--

CREATE TABLE `spheres` (
  `id` int(11) NOT NULL,
  `name` varchar(120) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `description` tinytext CHARACTER SET utf8 COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `spheres`
--

INSERT INTO `spheres` (`id`, `name`, `description`) VALUES
(1, 'Промисловість', ''),
(2, 'Сільське господарство', ''),
(3, 'Транспорт та зв\'язок', ''),
(4, 'Діяльність великих та середніх  підприємств до оподаткування', ''),
(5, 'Будівельна діяльність', ''),
(6, 'Капітальні інвестиції', ''),
(7, 'Оплата праці', ''),
(8, 'Зайнятість населення', '');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `indicators`
--
ALTER TABLE `indicators`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `spheres`
--
ALTER TABLE `spheres`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `indicators`
--
ALTER TABLE `indicators`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=38;
--
-- AUTO_INCREMENT для таблицы `spheres`
--
ALTER TABLE `spheres`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
