-- phpMyAdmin SQL Dump
-- version 4.7.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Май 30 2018 г., 08:39
-- Версия сервера: 10.1.25-MariaDB
-- Версия PHP: 7.1.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `test2`
--

-- --------------------------------------------------------

--
-- Структура таблицы `achievements`
--

CREATE TABLE `achievements` (
  `id` int(11) NOT NULL,
  `name` varchar(500) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `doctype` varchar(300) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `type` int(11) NOT NULL,
  `maxball` int(11) NOT NULL,
  `comments` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `achievements`
--

INSERT INTO `achievements` (`id`, `name`, `doctype`, `type`, `maxball`, `comments`) VALUES
(1, 'Участь у наукових конференціях, семінарах, інтернет-конференціях', 'Тези доповідей конференції або програма конференції', 1, 20, ''),
(2, 'Публікація, виступ та отримання відзнаки за участь у конференції', 'Тези, диплом, відзнака або інший підтверджуючий документ', 1, 40, ''),
(3, 'Публікація статей за матеріалами конференцій', 'Ксерокопія статті', 1, 40, ''),
(4, 'Призове місце на:\r\n- ІІ турі Всеукраїнських студентських олімпіад;\r\n- Всеукраїнському конкурсі науково-дослідних робіт студентів (республіканський рівень);\r\n- Всеукраїнському студентському турнірі, міжнародній олімпіаді або турнірі (республіканський рівень).', 'Наказ МОН України, сертифікат, диплом', 1, 100, ''),
(5, 'Призове місце на:\r\n- І турі Всеукраїнських студентських олімпіад;\r\n- регіональному конкурсі науково-дослідних робіт студентів.\r\n', 'Сертифікат або диплом', 1, 50, ''),
(6, 'Участь у міжнародних студентських олімпіадах, турнірах.', 'Сертифікат або диплом', 1, 50, ''),
(7, 'Публікація статті у виданні, що індексується системами SCOPUS та/або Web of Science.', 'Ксерокопія статті', 1, 100, ''),
(8, 'Публікація статті в іншому науковому виданні.', 'Ксерокопія статті', 1, 60, ''),
(9, 'Включення до складу національної, паралімпійської, юніорської, студентської збірної команди України.', 'Наказ, свідоцтво, інший підтверджуючий документ', 2, 100, ''),
(10, 'Виступ на офіційних міжнародних спортивних змаганнях.', 'Наказ, свідоцтво, інший підтверджуючий документ', 2, 100, ''),
(11, 'Виступ на офіційних Всеукраїнських (у тому числі студентських) спортивних змаганнях', 'Наказ, свідоцтво, інший підтверджуючий документ', 2, 60, ''),
(12, 'Виступ на обласних спортивних змаганнях', 'Наказ, свідоцтво, інший підтверджуючий документ', 2, 30, ''),
(13, 'Отримання звання майстер спорту України міжнародного класу', 'Посвідчення та інший документ, що підтверджує продовження спортивної кар’єри', 2, 100, ''),
(14, 'Отримання звання майстер спорту України', 'Посвідчення та інший документ, що підтверджує продовження спортивної кар’єри', 2, 80, ''),
(15, 'Отримання звання кандидат у майстри спорту України', 'Посвідчення та інший документ, що підтверджує продовження спортивної кар’єри', 2, 50, ''),
(16, 'Успішна робота в якості організатора, координатора Всеукраїнської або міжнародної конференції', 'Наказ про проведення конференції або/та копія сторінки збірника публікацій конференції зі складом організаційного комітету ', 1, 30, ''),
(17, 'Успішна робота в якості керівника під час підготовки роботи МАН, участь в якості тренера команди до Всеукраїнської олімпіади/турніру.', 'Сертифікат, інший підтверджуючий документ від відповідальної організації', 1, 30, ''),
(18, 'Отримання патенту на рівні України/міжнародному', 'Копія сторінок патенту зі вказівкою на власника та/або інший підтверджуючий документ про наявність патенту виданий Патентбюро', 1, 100, ''),
(19, 'Успішна робота в якості організатора, координатора загальноуніверситетських та факультетський освітніх, наукових, соціальних, гуманітарних та культурних проектів (таких, як Харків’яни на фронтах АТО, День донора, День захисту від СНІДу, Ніч науки, турніри та олімпіади школярів, Karazin Student’s Card, День випускника, День знань, Тиждень першокурсника, Красуня університету, Містер університет, Аlma-mater, Каразінський зимовий бал, робота в студентських ЗМІ університету, тощо)', 'Витяг із протоколу засідання Студентської ради університету або Первинної профспілкової організації студентів, аспірантів і докторантів або Наукового товариства студентів, аспірантів, докторантів і молодих учених та інший підтверджуючий документ', 3, 0, '60\r\n (??????? ?? ??? ??????, ??? ?? ?????? 30 ?? ???? ??????)\r\n'),
(20, 'Успішна робота в якості організатора моніторингу якості освітнього процесу, який проводиться Студентською радою університету та студентськими радами факультетів (навчально-наукових інститутів)', 'Витяг із протоколу засідання Студентської ради університету', 3, 0, '?? ?????? 40'),
(21, 'Успішна робота в якості організатора, координатора заходів із реалізації соціально-економічних прав студентів (таких, як забезпечення пільгового проїзду студентів у метрополітені; допомога в оформленні житлових субсидій тощо)', 'Витяг із протоколу засідання первинної профспілкової організації студентів, аспірантів і докторантів університету', 3, 0, '60\r\n???????? ????????, ??? ?? ?????? 30 \r\n?? ???? ??????'),
(22, 'Успішна робота в якості організатора, координатора заходів із покращення умов проживання у гуртожитках(таких, як обладнання та координація роботи спортивних кімнат; організація і проведення конкурсу на кращу кімнату гуртожитків студмістечка; організація Спартакіади гуртожитків, проведення рейдів-перевірок із питань дотримання Правил внутрішнього розпорядку у гуртожитках; проведення господарчих, ремонтних робіт у студмістечку, організація заходів з ефективного енергозбереження в гуртожитках тощо)', 'Витяг із протоколу засідання Студентської ради студмістечка', 3, 0, '60\r\n(??????? ?? ??? ??????)\r\n??? ?? ?????? 30 ?? ???? ?????\r\n'),
(23, 'Лідер громадського руху університету, який представляє інтереси студентів у Всеукраїнських, регіональних або міжнародних об’єднаннях', 'Свідоцтво, інший підтверджуючий документ', 3, 40, ''),
(24, 'Успішна робота в якості організатора, координатора освітніх, наукових, творчих і громадських заходів на регіональному, всеукраїнському рівнях', 'Сертифікат, диплом', 3, 30, ''),
(25, 'Призове місце у наукових, творчих заходах на регіональному, всеукраїнському рівнях', 'Сертифікат, диплом, подання керівників творчих колективів', 3, 30, '');

-- --------------------------------------------------------

--
-- Структура таблицы `faculties`
--

CREATE TABLE `faculties` (
  `id` int(11) NOT NULL,
  `name` varchar(70) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `description` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `faculties`
--

INSERT INTO `faculties` (`id`, `name`, `description`) VALUES
(1, 'Біологічний', ''),
(2, 'Геології, географії, рекреації і туризму', ''),
(3, 'Екологічний', ''),
(4, 'Економічний', ''),
(5, 'Іноземних мов', ''),
(6, 'Історичний', ''),
(7, 'Комп’ютерних наук', ''),
(8, 'Математики і інформатики', ''),
(9, 'Міжнародних економічних відносин та туристичного бізнесу', ''),
(10, 'Медичний', ''),
(11, 'Психології', ''),
(12, 'Радіофізики, біомедичної електроніки та комп’ютерних систем', ''),
(13, 'Соціологічний', ''),
(14, 'Фізико-енергетичний', ''),
(15, 'Фізико-технічний', ''),
(16, 'Фізичний', ''),
(17, 'Філологічний', ''),
(18, 'Філософський', ''),
(19, 'Хімічний', ''),
(20, 'Юридичний', ''),
(21, 'Каразінська школа бізнесу', '');

-- --------------------------------------------------------

--
-- Структура таблицы `groups`
--

CREATE TABLE `groups` (
  `id` int(11) NOT NULL,
  `name` int(11) NOT NULL,
  `year` int(11) NOT NULL,
  `faculty` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- --------------------------------------------------------

--
-- Структура таблицы `list`
--

CREATE TABLE `list` (
  `id` int(11) NOT NULL,
  `name` varchar(40) NOT NULL,
  `number` int(11) NOT NULL,
  `file` varchar(40) NOT NULL,
  `verification` int(11) NOT NULL DEFAULT '0',
  `originals` int(11) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `list`
--

INSERT INTO `list` (`id`, `name`, `number`, `file`, `verification`, `originals`) VALUES
(1, 'max', 31, '1425022881_mon1.png', 0, 0),
(2, 'Nil', 20, 'Karazin_-_Engraving.jpg', 0, 0);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `achievements`
--
ALTER TABLE `achievements`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `faculties`
--
ALTER TABLE `faculties`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `groups`
--
ALTER TABLE `groups`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `list`
--
ALTER TABLE `list`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `achievements`
--
ALTER TABLE `achievements`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;
--
-- AUTO_INCREMENT для таблицы `faculties`
--
ALTER TABLE `faculties`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;
--
-- AUTO_INCREMENT для таблицы `groups`
--
ALTER TABLE `groups`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT для таблицы `list`
--
ALTER TABLE `list`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
